---
kind: method
id: M:Autodesk.Revit.DB.GuidEnum.#ctor(System.Guid)
source: html/4812c792-89b8-3cfa-b63b-8a63adbd535b.htm
---
# Autodesk.Revit.DB.GuidEnum.#ctor Method

Creates an Guid-based enum instance with the supplied name and GUID.
GUID-based enum instance can be compared by this guid value.

## Syntax (C#)
```csharp
public GuidEnum(
	Guid guid
)
```

## Parameters
- **guid** (`System.Guid`) - The GUID of this GUID-based enum.